<a href="https://colab.research.google.com/github/ssudheerrao/test/blob/master/Data%20frame%20merge%2Cconcat.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

In [99]:
d={'1':'ss','2':'ssr','3':np.nan,'4':'ddf',np.nan:'tt'}
d

{'1': 'ss', '2': 'ssr', '3': nan, '4': 'ddf', nan: 'tt'}

In [100]:
d={'first':['ss','sd','df'],'second':['ss','sd','df'],'third':['ss','sd','df'],'forth':['ss','sd','df'],'fifth':['ss','sd','df']}
d

{'fifth': ['ss', 'sd', 'df'],
 'first': ['ss', 'sd', 'df'],
 'forth': ['ss', 'sd', 'df'],
 'second': ['ss', 'sd', 'df'],
 'third': ['ss', 'sd', 'df']}

In [121]:
d1={'first1':['ss','sd','df'],'second1':['ss','sd','df'],'third':['ss','sd','df'],'forth':['ss','sd','df']}
d1

{'first1': ['ss', 'sd', 'df'],
 'forth': ['ss', 'sd', 'df'],
 'second1': ['ss', 'sd', 'df'],
 'third': ['ss', 'sd', 'df']}

In [114]:
df1= pd.DataFrame(d)
df1

  first second third forth fifth
0    ss     ss    ss    ss    ss
1    sd     sd    sd    sd    sd
2    df     df    df    df    df

In [122]:
df2=pd.DataFrame(d1)
df2

  first1 second1 third forth
0     ss      ss    ss    ss
1     sd      sd    sd    sd
2     df      df    df    df

In [129]:
pd.merge(df1,df2,how="inner",on="third")

  first second third forth_x fifth first1 second1 forth_y
0    ss     ss    ss      ss    ss     ss      ss      ss
1    sd     sd    sd      sd    sd     sd      sd      sd
2    df     df    df      df    df     df      df      df

In [134]:
pd.concat([df1,df2],axis=1)

  first second third forth fifth first1 second1 third forth
0    ss     ss    ss    ss    ss     ss      ss    ss    ss
1    sd     sd    sd    sd    sd     sd      sd    sd    sd
2    df     df    df    df    df     df      df    df    df

In [69]:
df= pd.DataFrame(d.items(),columns={'id','name'})
df

  name   id
0    1   ss
1    2  ssr
2    3  NaN
3    4  ddf
4  NaN   tt

In [70]:
df.isnull().sum()

name    1
id      1
dtype: int64

In [82]:
import pandas as pd
import numpy as np

d1 = {'Name': ['Pankaj', 'Meghna', 'David', pd.NaT], 'ID': [1, 2, 3, pd.NaT], 'Salary': [100, 200, np.nan, pd.NaT],
      'Role': [10, np.nan, pd.NaT, pd.NaT]}

df = pd.DataFrame(d1)

print(df)

df.isnull().sum()
df.dropna(axis=0)
df

     Name   ID Salary Role
0  Pankaj    1    100   10
1  Meghna    2    200  NaN
2   David    3    NaN  NaT
3     NaT  NaT    NaT  NaT

     Name   ID Salary Role
0  Pankaj    1    100   10
1  Meghna    2    200  NaN
2   David    3    NaN  NaT
3     NaT  NaT    NaT  NaT

In [88]:
import pandas as pd
import numpy as np

d1 = {'Name': ['Pankaj', 'Meghna', 'David', pd.NaT], 'ID': [1, 2, 3, pd.NaT], 'Salary': [100, 200, np.nan, pd.NaT],
      'Role': [10, np.nan, pd.NaT, pd.NaT]}

df = pd.DataFrame(d1)

print(df)

df.isnull().sum()
df.dropna(subset=['Salary'],inplace=True)
df

     Name   ID Salary Role
0  Pankaj    1    100   10
1  Meghna    2    200  NaN
2   David    3    NaN  NaT
3     NaT  NaT    NaT  NaT

     Name ID Salary Role
0  Pankaj  1    100   10
1  Meghna  2    200  NaN

In [95]:
df.drop('Name',axis=1)

  ID Salary Role
0  1    100   10
1  2    200  NaN

In [96]:
df.astype(float)

ValueError: ignored

In [29]:
se =pd.Series(d,name='sname')
se

1     ss
2    ssr
3
4    ddf
      tt
Name: sname, dtype: object

In [32]:
se.reset_index()

  Num sname
0   1    ss
1   2   ssr
2   3
3   4   ddf
4        tt

In [31]:
se.index.name='Num'
se

Num
1     ss
2    ssr
3
4    ddf
      tt
Name: sname, dtype: object

In [9]:
greater=(lambda x,y: x if x>y else y)
greater(2,3)

3

In [ ]:
df= pd.DataFrame()

In [10]:
cube=[5,6,4,8,9]
list(map(lambda x:x**3,cube))

[125, 216, 64, 512, 729]